
import LeanVeri.Projection
import LeanVeri.LinearMapPropositions
import Mathlib.LinearAlgebra.TensorProduct.Basic

/-
  Löwner order of (|-><-|,|+><+|) is greater than (0, 1/2I + |0><0|)

  (|-><-|,|+><+|) >= (0, 1/2I + |0><0|)
  Let
    A₁ ≃ (Xₐ¹, Pₐ¹), where  A₁                      ∈ Pos∞(ℍ),
                            Xₐ¹ = |-⟩⟨-|            ∈ S(ℍ),
                            Pₐ¹ = |+⟩⟨+|            ∈ Pos(ℍ)
                            s.t. Pₐ¹Xₐ¹ = 0 (Orthogonal)
    A₂ ≃ (Xₐ², Pₐ²), where  A₂                      ∈ Pos∞(ℍ),
                            Xₐ² = O                 ∈ S(ℍ),
                            Pₐ² = 1⧸2 ⬝ I + |0⟩⟨0|   ∈ Pos(ℍ)
                            s.t. Pₐ²Xₐ² = 0 (Orthogonal)

  Obligation:
    ∀ |ψ⟩ ∈ ℍ,  ⟨ψ|(Pₐ¹ + (+∞ . Xₐ¹))|ψ⟩ ≥ ⟨ψ|(Pₐ² + (+∞ . Xₐ²))|ψ⟩
  Proof.
    By subs:
      - ⟨ψ|(|+⟩⟨+| + (+∞ . |-⟩⟨-|))|ψ⟩ ≥ ⟨ψ|(1⧸2 ⬝ I + |0⟩⟨0| + (+∞ . O))|ψ⟩
    By simp:
      - ⟨ψ|+⟩⟨+|ψ⟩ + ⟨ψ|(+∞ . |-⟩⟨-|)|ψ⟩ ≥ ⟨ψ|(1⧸2 ⬝ I)|ψ⟩ + ⟨ψ|0⟩⟨0|ψ⟩ + ⟨ψ|(+∞ . O)|ψ⟩
      - ⟨ψ|+⟩⟨+|ψ⟩ + +∞ . ⟨ψ|-⟩⟨-|ψ⟩ ≥ 1⧸2 ⬝ ⟨ψ|I|ψ⟩ + ⟨ψ|0⟩⟨0|ψ⟩ + (+∞ .⟨ψ|O|ψ⟩)
      - ⟨ψ|+⟩⟨+|ψ⟩ + +∞ . ⟨ψ|-⟩⟨-|ψ⟩ ≥ 1⧸2 ⬝ ⟨ψ|I|ψ⟩ + ⟨ψ|0⟩⟨0|ψ⟩ + (+∞ .⟨ψ|O|ψ⟩)
      - ⟨ψ|+⟩⟨+|ψ⟩ + +∞ . ⟨ψ|-⟩⟨-|ψ⟩ ≥ 1⧸2 ⬝ ⟨ψ|ψ⟩   + ⟨ψ|0⟩⟨0|ψ⟩ + (+∞ . 0)
      - ⟨ψ|+⟩⟨+|ψ⟩ + +∞ . ⟨ψ|-⟩⟨-|ψ⟩ ≥ 1⧸2 ⬝ ⟨ψ|ψ⟩   + ⟨ψ|0⟩⟨0|ψ⟩ + 0
      - ‖⟨ψ|+⟩‖²   + +∞ . ‖⟨ψ|-⟩‖²   ≥ 1⧸2 ⬝ ⟨ψ|ψ⟩   + ‖⟨ψ|0⟩‖²

      By cases on ‖⟨ψ|-⟩‖²
      · case: ‖⟨ψ|-⟩‖² = 0
        - ‖⟨ψ|+⟩‖² ≥ 1⧸2 ⬝ ⟨ψ|ψ⟩ + ‖⟨ψ|0⟩‖²
        - Have lemma AUX: ‖⟨ψ|-⟩‖² = 0 ↔ ∃ λ ∈ ℂ, |ψ⟩ = λ|+⟩ (Need proof)
          Have |ψ⟩ = λ|+⟩ for some λ ∈ ℂ (by lemma AUX)
          - ‖⟨ψ|+⟩‖² ≥ 1⧸2 ⬝ ⟨ψ|ψ⟩ + ‖⟨ψ|0⟩‖²
          - By simp,
              - ‖⟨+|λ|+⟩‖² ≥ 1⧸2 ⬝ λ²⟨+|+⟩ + ‖⟨+|λ|0⟩‖²
              - λ² ≥ 1/2 · λ² + 1/2 . λ²
              - λ² ≥ λ² (Trivially True)

      · case: ‖⟨ψ|-⟩‖² ≠ 0
        - +∞ ≥ 1⧸2 ⬝ ⟨ψ|ψ⟩ + ‖⟨ψ|0⟩‖² (Trivially True)
-/

/-
  (|-><-|,|+><+|) ≥ (0, 1/2I + |1><1|)

  Proof. Same pattern as the one above.
-/
